src/cf/Catalogs/ЦеновыеМодели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ЦеновыеМодели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстЦеновойМодели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КонтекстЦеновойМодели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ХранимыеИзображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ХранимыеИзображения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектПривязки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Ошибка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Результат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеМодели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ЦеновыеМодели/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ОтобразитьКартинкуДляЭлемента();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКартинкуДляЭлемента()
	
	Если ТипЗнч(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Картинка = Неопределено;
		Возврат;		
	КонецЕсли;
	Изображение = Неопределено;
	Ссылка= ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Ссылка; 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранимыеИзображения.Изображение КАК Изображение
	|ИЗ
	|	РегистрСведений.ХранимыеИзображения КАК ХранимыеИзображения
	|ГДЕ
	|	ХранимыеИзображения.ОбъектПривязки = &Ссылка
	|	И ХранимыеИзображения.Номер = 1";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Изображение = ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.Изображение.Получить());		
	КонецЦикла;
	
	Если НЕ Изображение = Неопределено  Тогда
		Картинка = Изображение;
	Иначе 
		Картинка = Неопределено;		   	   
	КонецЕсли;
	
	
	
КонецПроцедуры // ПолучитьКартинкуДляЭлемента()
